Vertically compound wall type features sweeps, reveals, or split layers are not supported on non-vertical face. Consider using a simplified type.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId FaceWallComplexType { get; }
  Visual Basic
Public Shared ReadOnly Property FaceWallComplexType As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FaceWallComplexType {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures WallFailures Class
  Autodesk.Revit.DB Namespace